MyFirst_Application/app/controllers/students_controller.rb

INSERT INTO "students" ("Address", "age", "created_at", "description", "first_name", "last_name", "stream", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@student = Student.new(params[:student])
	   if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = 2 LIMIT 1
---
	def edit
	  @student  = Student.find_by_id(params[:id])

SELECT "students".* FROM "students" WHERE "students"."id" = 2 LIMIT 1
UPDATE "students" SET "last_name" = 'khan', "age" = '24', "stream" = 'it', "Address" = 'govindpuri', "description" = 'trainee', "updated_at" = '2013-10-07 09:58:16.410789' WHERE "students"."id" = 3
---
	def update
		@student = Student.find_by_id(params[:id])

		if @student.update_attributes(params[:student])

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
	def destroy
      @student = Student.find(params[:id])
      @student.destroy